src/DataProcessors/КонтрольОшибокВыпискиРТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КонтрольОшибокВыпискиРТУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/КонтрольОшибокВыпискиРТУ/Ext/ObjectModule.bsl
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	Если Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.КонтрольВыгрузкиРТУВТоплог тогда 
		 обработки.КонтрольОшибокВыпискиРТУ.КонтрольВыгрузкиРТУВТоплог(Период,Событие);
	ИначеЕсли Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.КонтрольСтатусовРТУ тогда 
		  обработки.КонтрольОшибокВыпискиРТУ.КонтрольСтатусовРТУ(Период,Событие); 
	ИначеЕсли Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.КонтрольВыпискиVMIбезРасписания тогда 
		  
	Конецесли;	
		
КонецПроцедуры
